text = input("Введите строку: ") # запрашиваем строку
words = text.split() # создаем список из слов в строке разделенных пробелами
i = 0 # будущий счетчик
times = 0 # переменная для счета слов
while i < len(words): # а вот и счетчик
    word = words[i] # по очереди берем каждое слово из списка начиная с i = 0
    if (word == "Python" or word == "python"): # проверяем является ли это слово Ppython
        times += 1 # если да то добавдяем еденицы в счетчик слов в строке
    i += 1 # увеличивем счетчик на 1
print(f"{times} раз(a)") # выводим количество раз
