text = input("Введите строку: ") # запрашиваем строку
words = text.split() # создаем список из слов в строке разделенных пробелами
i = 0 # будущий счетчик
new_text = "" # строка в которую мы будем записывать обработанные слова
while i < len(words): # а вот и счетчик
    word = words[i] # по очереди берем каждое слово из списка начиная с i = 0
    new_word = word[-1] + word[1:-1] + word[0] # обрабатываем слово: берем последнюю букву прибовляем к ней слово начинающееся со второго символа и заканчивающееся предпоследним символом и добавляем к ним первую букву слова
    i += 1 # увеличивем счетчик на 1
    new_text += new_word + " " # записываем в переменную обработанное слово и добавляем пробел
print(new_text) # выводим новое слово
